In [11]:
import pandas as pd

In [12]:
df =  pd.read_csv("titanic.csv", sep = "|")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Group by

Usaremos group by para agrupar los datos según los valores de una o más columnas.
Este método crea una estructura de datos particular a la que le podemos aplicar diferentes operaciones.
Group by sólo crea la estructura de datos a la que se le puede aplicar la función de agregación o estadísticas.

In [6]:
df.groupby('Sex').count()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Sex,,,,,,,,,,,
female,314,314,314,314,261,314,314,314,314,97,312
male,577,577,577,577,453,577,577,577,577,107,577

Si la operación a realizar solo admite números, se aplica a las columnas numéricas exclusivamente

In [7]:
df.groupby('Sex').mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [ ]:
Tres maneras de restringir el resultado a ciertas columnas:
    
1) Seleccionar la columna de interés, luego de hacer las operaciones.
2) Seleccionar las columnas necesarias antes de hacer el groupby
(se debe incluir la columna con la que agrupar).
3) Seleccionar la columna de interés después de hacer el groupby, 
pero antes de aplicar la función de agregación.

In [8]:
df.groupby('Sex').mean()['Age'] #Opción 1

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [10]:
df[['Sex','Age']].groupby('Sex').mean() #Opción 2

              Age
Sex
female  27.915709
male    30.726645

In [13]:
df.groupby('Sex')['Age'].mean() #Opción 3

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

En mi caso prefiero utilizar la opción dos porque me parece mas ordenada, 
pero con cualquiera de las 3 llegamos al mismo resultado.